#### Data Formatting 
##### Data Formatting is the process of changing the apperance, structure or data type of data without changing its meaning, so it becomes consistent, readable and already for analysis.

In [16]:
import pandas as pd
df = pd.read_excel("Student_info.xlsx")

In [18]:
print(df)

    Unnamed: 0  S.No   Name   Roll  Marks
0            0     1     Raj    22     55
1            1     2     Dev    24     65
2            2     3      Om     1     55
3            3     4    Neil     6     65
4            4     5   Kunal     5     55
5            5     6     Sam     8     85
6            6     7   Aryan    20     70
7            7     8   Varun    15     60
8            8     9  Nikhil    14     65
9            9    10  Ramesh    13     85
10          10    11   Sunil     8     60

In [59]:
df["Marks"].head()
df["Marks"].max()

0.13599999999999995

In [61]:
df["Marks"] = df["Marks"] * 100

In [63]:
df.head()

   Unnamed: 0  S.No  Name   Roll  Marks
0           0     1    Raj    22    8.8
1           1     2    Dev    24   10.4
2           2     3     Om     1    8.8
3           3     4   Neil     6   10.4
4           4     5  Kunal     5    8.8